**** DONE Copy line map file from external SSD
CLOSED: [2022-04-09 Sat 22:19]
#+begin_src sh :results verbatim :dir ..
  FROM=/Volumes/SSD-2TB/OrionMuse/LineMaps
  TO=data/muse

  rsync -avP $FROM/linesum-O_I-5577.fits $TO
#+end_src

#+RESULTS:
: sending incremental file list
: 
: sent 69 bytes  received 12 bytes  162.00 bytes/sec
: total size is 10,431,360  speedup is 128,782.22

*** Calculate T from 5577/6300 ratio using pyneb

- Assume density of 1e4, although low density limit is only 2% different
- Look at line ratios between 0.01 and 0.025
#+begin_src python :results output verbatim
  import numpy as np
  import pyneb as pn

  oi = pn.Atom("o", 1)
  print(
      oi.getTemDen(
          [0.01, 0.015, 0.02, 0.025],
          den=10000.,
          wave1=5577,
          wave2=6300,
      )
  )
  print(
      oi.getCritDensity([300, 1000, 3000, 1e4], 4) / 1e6
  )
  print(
      oi.getCritDensity([300, 1000, 3000, 1e4], 5) / 1e6
  )


#+end_src

#+RESULTS:
: [ 7749.10315973  8739.28995845  9616.82836919 10522.85809857]
: [0.64448614 1.17666532 2.03780737 1.53064331]
: [27.97285258 51.07120786 88.45792681 95.391892  ]
- This shows that the temperature near the brightness peak is about 8700 K
  - although still need to correct for reddening,  which would put the T up a bit
  - The reddening from the Balmer decrement should be a lower limit to the reddening to the ionization front
- I also print the critical electron density for the 6300 and 5577 lines, in units of 1e6 pcc
